app/Http/Controllers/Mimica/WebController.php

select name, avatar, users.id, sum(pontos) pontos, count(partida_id) qtd_partida from `users` inner join `partidas_equipes` on `users`.`id` = `partidas_equipes`.`user_id` where `users`.`anonimo` = 0 group by `users`.`id`, `users`.`name`, `users`.`avatar` order by `pontos` desc
select * from `posts` where `revisao` = 'false' order by `created_at` desc
---
    public function home()
    {

        //cache ranking
        if (Cache::has('ranking')) {
            $usersRanking = Cache::store('file')->get('ranking');
        } else {
            $usersRanking = DB::table('users')
            ->join('partidas_equipes', 'users.id', '=', 'partidas_equipes.user_id')
            ->selectRaw('name, avatar, users.id, sum(pontos) pontos, count(partida_id) qtd_partida')
            ->where('users.anonimo', false)
            ->groupBy('users.id', 'users.name', 'users.avatar')
            ->orderBy('pontos', 'DESC')
            ->get()->take(10);

            Cache::store('file')->put('ranking', $usersRanking, now()->addDay(1));
        }

        // cache posts
        if (Cache::has('posts')) {
            $posts = Cache::store('file')->get('posts');
        } else {
            $posts = Post::where('revisao', 'false')->orderBy('created_at', 'DESC')->get();

select * from `posts_redes_sociais` where `media_type` = 'VIDEO' order by `timestamp` desc
---
        if (Cache::has('posts_instagram')) {
            $midias = Cache::store('file')->get('posts_instagram');
        } else {
            $midias = PostsRedesSociais::where('media_type', 'VIDEO')->orderBy('timestamp', 'DESC')->get();